
'''
汉字转拼音首字母
pip install pypinyin
'''
import ChineseToFirst as cf



area_dict = {
"市发展改革委",
"市公安局",
"市财政局",
"市城管局",
"市城乡水务局",
"市大数据局",
"市国资委",
"市工业和信息化局",
"市海洋发展渔业局",
"市环保局",
"市生态环境局",
"市交通运输局",
"市教育局",
"市科技局",
"市粮食和储备局",
"市文化和旅游局",
"市农业农村局",
"市民政局",
"市人力资源社会保障局",
"市商务局",
"市审计局",
"市市场监管局",
"市司法局",
"市体育局",
"市统计局",
"市退役军人事务局",
"市卫生健康委",
"市信访局",
"市医疗保障局",
"市应急局",
"市邮政管理局",
"市住房城乡建设局",
"市自然资源规划局",
"市行政审批服务局",
"市委组织部",
"市委宣传部",
"市委统战部",
"市委政法委",
"市委网信办",
"市妇女联合会",
"市法院",
"市检察院",
"市国家安全局",
"市消防救援支队",
"市仲裁委"
}
for n in area_dict:
    print(n,cf.toLowFirst(n))
    
# print(cf.toLowAll(text))
# print(cf.toLowFirst(text))
# print(cf.toUpperAll(text))
# print(cf.toUpperFirst(text))