# -*- coding: utf-8 -*-
import os, time
import random
import shutil
'''
读取excel表格并复制一份重命名
'''
# 字典
metadata = {
    "2023级大数据5班":{"杜子恒","陈晓天","张梓航","任静伟","李心雨","张一蕊","耿甲妍","袁鑫","付屹桐","孙熠婷","付露冉","潘德凤","李秋歌","闫玉娇","王帅","任轩鞍","王泽翾","胡家纬","王虹程","张哲","刘怡婧","张天婧","冯蕊","胡昕阳","武子昊","孟玉轩","胡紫贺","宋鑫","田浩","姜鸣一","卢静怡","徐璇","王文垚","齐文华","王俊皓","宁帅泽","韩家璇","蒲怡含","高雨寒","刘鑫越","梁紫涵","顾新旺","吴广震","梁亚坤","马光瑞","冯雅诺","王旭","付飞扬"},
    "2023级大数据6班":{"赵洛雨","赵泽天","代紫盈","陈思佳","提寿臣","王彬","万正豪","薛梦娇","孙璐瑶","李泽浩","马冰","闫静怡","葛青瑞","任爱","梁爽","杨贺斐","张梦晗","张紫玉","苏士哲","王蔓","刘兆宇","吕婧玟","孙林","张恒硕","郭天硕","张雅璇","李佩卓","李洪成","高淼","李鑫桐","王晨爽","杨紫嫣","孙一凡","李祐墨","李建伟","董佳悦","史子涵","崔佳语","张国庆","王子璇","朱怡宁","王薪凯","李颖","景淼","李博","李星安","张珂浩","高佳辉"},
    "2024级大数据4班":{"李玉华","王宇哲","宋奎儒","李佳思","陈亚平","李东旭","林子涵","陈宇翔","高懿","鲁守宁","范惠湉","李思楠","张昭富","张雅淇","单福栋梁","宋加濠","徐佳豪","姜舒然","刘易阳","张润泽","沈子皓","樊占沛","宋昕媛","丁宽童","渠梦珂","满英杰","朱静","宋浩然","王东雨","李雨杉","李启涵","陈心蕾","秦尚琪","黄嘉微","高梦圆","单志轩","吴纪恩","王毅","季建隆","高希旗","吴天昊","李翔宇","王磊"},
    "2024级大数据5班":{"韩若宣","安艺楠","史梦雪","席玉翠","秦柯林","范云飞","陈思羽","田浩然","李成林","陈令昌","宋子衡","陈娇娇","杨柯","姚子轩","董庶薪","卢炳旭","齐瑞林","张文凯","刘骐硕","赵瑞雪","王新冉","钱宇洁","苗同熙","周梦佳","侯天乐","范瑞卿","董勤勤","罗慧","张雨涵","张怡丹","齐梦","马玉涵","孟千琪","陈正","李明","黑志洋","张金春","刘焕毓","梁富智","黄复鹏","于俊含","崔宇铄"},
    "2024级人工智能3班":{"张月驰","丁瑜","李天彬","王馨阳","李庆哲","张荣天","李梓冉","尹伟","昝钰恒","李佳鹏","李传聪","徐一鸣","卞子阳","陆晶晶","张少鹏","郭恒瑞","刘志豪","张槐豫","吕传志","徐子涵","贾然","刘俊杰","刘翔宇","宋辉","吕龙欣","曾凡雨","霍瑞康","王进辉","孔依然","郭庆硕","曲铭琛","段其乐","李易军","张洋","宋子琪","宋志文","王明昊","王士芬","李文朔","赵浩然","张紫涵","赵新鹏","周晓晶","黄子恒","李俊杰","刘世泽","于江鸿","徐成","杨兴森","郭炳辰","王振铎","姚文琰","宋冠颖"},
    "2024级人工智能4班":{"杨法瑞","高昊睿","巩承昊","庞永琦","吕烁","公凡凡","范晓玲","刘洋","张盛山","王欣奥","朱庚浩","臧浩然","冯奥伟","陈天宇","刘佳怡","王若菲","贾厚浩","孙浩","王越","闫浩然","刘进强","李梦姣","景天旭","徐瑞晨","李彦甫","王杰","于乃朔","韩建强","别艳青","张明宇","孟宪礼","钟俊","花雨昊","吴博","韩志伟","王玉陶","曹伟伟","葛峻豪","魏超冉","孙思琦","鹿明浩","杨浩宇","岳鹏宇","贠佳贺","高申泰","阮辰淇","张传浩","张善航","陈梦宇"}
}

# 复制并重命名文件
def copyExcel(keyname):
    global metadata
    source_path = 'D:/Program Files/PortableGit/test/tiantai/工作文件/卜凯凯讲师-调查问卷/23级大数据5/讲师调查问卷-XXX学生.xls'  # 样本文件
    
    selected_names = random.sample(list(metadata[keyname]), k=7)  # 随机选7个学生
    for name in selected_names:
        dest_path = f'D:/Program Files/PortableGit/test/tiantai/工作文件/test/{keyname}/讲师调查问卷-{name}学生.xls'    # 拼接全路径
        shutil.copy(source_path, dest_path)            # 复制并重命名文件
        print(f"已复制并重命名为: {dest_path}")
    
def createdir():
    global metadata
    base_folder_path = r'D:\Program Files\PortableGit\test\tiantai\工作文件\test'

    for temp_key in metadata.keys():
        folder_full_path = os.path.join(base_folder_path, temp_key)
        if not os.path.exists(folder_full_path):        # 如果路径不存在，则创建
            os.makedirs(folder_full_path)
            copyExcel(temp_key)                         # 复制并重命名文件
            print(f"已创建文件夹：{folder_full_path}")
        else:
            print(f"文件夹已存在，跳过：{folder_full_path}")

    print("操作完成。")
    
if __name__ == "__main__":
    createdir()
