# -*- coding: utf-8 -*-
from datetime import datetime, time, timedelta
import openpyxl
import os
'''
读取excel表格与声明集合中的做对比，打印在集合中，但是不在excel中的数据
'''
def readExcel():
    yesterday = (datetime.now() - timedelta(days=1)).date()
    # yesterday = datetime(2025, 6, 10).date() #Excel表中提交作业那天
        
    weekday = yesterday.weekday()+1
    print(yesterday)
    print(weekday)
    
    my_set = set()
    s23da5 = {"杜子恒","陈晓天","张梓航","任静伟","李心雨","张一蕊","耿甲妍","袁鑫","付屹桐","孙熠婷","付露冉","潘德凤","李秋歌","闫玉娇","王帅","任轩鞍","王泽翾","胡家纬","王虹程","张哲","刘怡婧","张天婧","冯蕊","胡昕阳","武子昊","孟玉轩","胡紫贺","宋鑫","田浩","姜鸣一","卢静怡","徐璇","王文垚","齐文华","王俊皓","宁帅泽","韩家璇","蒲怡含","高雨寒","刘鑫越","梁紫涵","顾新旺","吴广震","梁亚坤","马光瑞","冯雅诺","王旭","付飞扬"}
    s23da6 = {"赵洛雨","赵泽天","代紫盈","陈思佳","提寿臣","王彬","万正豪","薛梦娇","孙璐瑶","李泽浩","马冰","闫静怡","葛青瑞","任爱","梁爽","杨贺斐","张梦晗","张紫玉","苏士哲","王蔓","刘兆宇","吕婧玟","孙林","张恒硕","郭天硕","张雅璇","李佩卓","李洪成","高淼","李鑫桐","王晨爽","杨紫嫣","孙一凡","李祐墨","李建伟","董佳悦","史子涵","崔佳语","张国庆","王子璇","朱怡宁","王薪凯","李颖","景淼","李博","李星安","张珂浩","高佳辉"}
    
    s24da4 = {"李玉华","王宇哲","宋奎儒","李佳思","陈亚平","李东旭","林子涵","陈宇翔","高懿","鲁守宁","范惠湉","李思楠","张昭富","张雅淇","单福栋梁","宋加濠","徐佳豪","姜舒然","刘易阳","张润泽","沈子皓","樊占沛","宋昕媛","丁宽童","渠梦珂","满英杰","朱静","宋浩然","王东雨","李雨杉","李启涵","陈心蕾","秦尚琪","黄嘉微","高梦圆","单志轩","吴纪恩","王毅","季建隆","高希旗","吴天昊","李翔宇","王磊"}
    s24da5 = {"韩若宣","安艺楠","史梦雪","席玉翠","秦柯林","范云飞","陈思羽","田浩然","李成林","陈令昌","宋子衡","陈娇娇","杨柯","姚子轩","董庶薪","卢炳旭","齐瑞林","张文凯","刘骐硕","赵瑞雪","王新冉","钱宇洁","苗同熙","周梦佳","侯天乐","范瑞卿","董勤勤","罗慧","张雨涵","张怡丹","齐梦","马玉涵","孟千琪","陈正","李明","黑志洋","张金春","刘焕毓","梁富智","黄复鹏","于俊含","崔宇铄"}
    s24r3 = {"张月驰","丁瑜","李天彬","王馨阳","李庆哲","张荣天","李梓冉","尹伟","昝钰恒","李佳鹏","李传聪","徐一鸣","卞子阳","陆晶晶","张少鹏","郭恒瑞","刘志豪","张槐豫","吕传志","徐子涵","贾然","刘俊杰","刘翔宇","宋辉","吕龙欣","曾凡雨","霍瑞康","王进辉","孔依然","郭庆硕","曲铭琛","段其乐","李易军","张洋","宋子琪","宋志文","王明昊","王士芬","李文朔","赵浩然","张紫涵","赵新鹏","周晓晶","黄子恒","李俊杰","刘世泽","于江鸿","徐成","杨兴森","郭炳辰","王振铎","姚文琰","宋冠颖"}
    s24r4 = {"杨法瑞","高昊睿","巩承昊","庞永琦","吕烁","公凡凡","范晓玲","刘洋","张盛山","王欣奥","朱庚浩","臧浩然","冯奥伟","陈天宇","刘佳怡","王若菲","贾厚浩","孙浩","王越","闫浩然","刘进强","李梦姣","景天旭","徐瑞晨","李彦甫","王杰","于乃朔","韩建强","别艳青","张明宇","孟宪礼","钟俊","花雨昊","吴博","韩志伟","王玉陶","曹伟伟","葛峻豪","魏超冉","孙思琦","鹿明浩","杨浩宇","岳鹏宇","贠佳贺","高申泰","阮辰淇","张传浩","张善航","陈梦宇"}

    file_path = os.path.join(os.path.expanduser("~"), "Downloads", "每日课堂练习（收集结果）.xlsx") # 文件路径
    if os.path.exists(file_path):
        workbook = openpyxl.load_workbook(file_path) 
        sheet = workbook[workbook.sheetnames[0]]
            
        # 遍历工作表中的数据
        for index, row in enumerate(sheet.iter_rows(min_row=2, values_only=True), start=2): # min_row=2 跳过标题行，values_only=True 返回单元格值而不是对象
            cell_time = datetime.strptime(row[0], '%Y年%m月%d日 %H:%M')
            if cell_time.date() == yesterday: # 作业时间
                my_set.add(row[2])
        workbook.close()
        os.remove(file_path)
        print("文件已删除！")
    else:
        print("文件不存在...")
    
    # 在名单1但不在名单2的人
    if weekday == 1 : # 周二统计周一
        print(f'23级大数据5-' + str(s23da5 - my_set))  # 23级大数据5
        print(f'23级大数据6-' + str(s23da6 - my_set))  # 23级大数据6
        print(f'24级大数据5-' + str(s24da5 - my_set))  # 24级大数据5
    elif weekday == 2 : # 周三统计周二
        print(f'24级大数据4-' + str(s24da4 - my_set))  # 24级大数据4
    elif weekday == 3 : # 周四统计周三
        print(f'24级人工3-' + str(s24r3 - my_set))    # 24级人工3
        print(f'24级人工4-' + str(s24r4 - my_set))    # 24级人工4
    
if __name__ == "__main__":
    readExcel()
